#+BEGIN_COMMENT
.. title: Six Degrees
.. slug: six-degrees
.. date: 2017-11-10 12:36:10 UTC-08:00
.. tags: webscraping
.. category: experiment, how-to
.. link: 
.. description: Six Degrees of Wikipedia
.. type: text
#+END_COMMENT

* Introduction
  This is a basic introduction to making a web-crawler. It will start from a given [[https://en.wikipedia.org/wiki/Main_Page][wikipedia]] page and randomly pick pages to go to (up to six).

* Imports

#+BEGIN_SRC ipython :session sixdegrees :results none
# python standard library
from urllib.parse import urljoin
import random
import re

# pypi
from bs4 import BeautifulSoup
import requests
#+END_SRC

* The URLs

  The format for wikipedia URLs is the base URL ("https://en.wikipedia.org/wiki/") followed by the subject. If there are multiple words in the subject they are separated by underscores, e.g. "https://en.wikipedia.org/wiki/Ophiocordyceps_unilateralis". It will automatically set the first letter of the first word of the subject to a capital letter, but not the second word. So if it is a proper name it's case sensitive, but in some cases it isn't. 

  There are also special urls that start with a word followed by a colon (like "Category:") that we probably want to exclude.

#+BEGIN_SRC ipython :session sixdegrees :results none
WIKI_URL = "https://en.wikipedia.org"
BASE_PAGE = "/wiki/Main_Page"
LINK = re.compile("^/wiki/\w+[^:]\w*$")
OUTPUT = "{}\t[[{}][{}]]"
#+END_SRC

* A getter

  This is a function to get the page. It checks for errors and raises an error if there was one.

#+BEGIN_SRC ipython :session sixdegrees :results none
def get_page(page):
    """Gets the page
    
    Args:
     page (str): name of page (not the full URL)
    
    Returns:
     BeautifulSoup: the loaded page

    Raises:
     RuntimeError: the page wasn't successfully loaded
    """
    url = urljoin(WIKI_URL, page)
    response = requests.get(url)
    if not response.ok:
        raise RuntimeError("Unable to get {}".format(url))
    return BeautifulSoup(response.text, "html5lib")
#+END_SRC

* Next Page
  This will pick a random page from the one given.

#+BEGIN_SRC ipython :session sixdegrees :results none
def next_page(article):
    """Gets a random page

    Args:
     article (str): article link of the form '/wiki/<article>'

    Returns:
     str: random article link from the page
    """
    soup = get_page(article)
    links = (soup.find("div", {"id": "bodyContent"})
             .findAll("a", href=LINK))
    return links[random.randrange(len(links))]
#+END_SRC

* Grabbing the pages
#+BEGIN_SRC ipython :session sixdegrees :results none
def grab_pages(start=BASE_PAGE, count=6):
    """grabs random pages and lists their titles

    Args:
     start (str): article to start at
     count(int): number of pages to grab

    Returns:
     :class:`bs4.element.Tag`: last page found
    """
    page = next_page(start)
    print(OUTPUT.format(1, urljoin(WIKI_URL, page["href"]), page.attrs["title"]))
    for number in range(2, count+1):
        page = next_page(page.attrs["href"])
        print(OUTPUT.format(number, urljoin(WIKI_URL, page["href"]), page.attrs["title"]))
    return page
#+END_SRC

#+BEGIN_SRC ipython :session sixdegrees :results none
def to_path(article):
    """converts the article to /wiki/article

    Args:
     article (str): article to find

    Returns:
     str: path to article
    """
    return urljoin("/wiki/", article)
#+END_SRC

** First, a random six pages starting at the main Wikipedia page

#+BEGIN_SRC ipython :session sixdegrees :results output raw
grab_pages()
#+END_SRC

#+RESULTS:
1	[[https://en.wikipedia.org/wiki/Tropical_wave][Tropical wave]]
2	[[https://en.wikipedia.org/wiki/Tropics][Tropics]]
3	[[https://en.wikipedia.org/wiki/Bora_Bora][Bora Bora]]
4	[[https://en.wikipedia.org/wiki/Menehune][Menehune]]
5	[[https://en.wikipedia.org/wiki/United_Airlines][United Airlines]]
6	[[https://en.wikipedia.org/wiki/Grand_Canyon_Airlines][Grand Canyon Airlines]]

** Now random pages starting with Kevin Bacon's page
#+BEGIN_SRC ipython :session sixdegrees :results output raw
grab_pages(to_path("Kevin Bacon"))
#+END_SRC

#+RESULTS:
1	[[https://en.wikipedia.org/wiki/Mark_Ruffalo][Mark Ruffalo]]
2	[[https://en.wikipedia.org/wiki/Frances_de_la_Tour][Frances de la Tour]]
3	[[https://en.wikipedia.org/wiki/Alice_Ghostley][Alice Ghostley]]
4	[[https://en.wikipedia.org/wiki/Kaye_Ballard][Kaye Ballard]]
5	[[https://en.wikipedia.org/wiki/Follies][Follies]]
6	[[https://en.wikipedia.org/wiki/Arthur_Rubin][Arthur Rubin]]

** Some random 20 pages from the year 1968
#+BEGIN_SRC ipython :session sixdegrees :results output raw
grab_pages(to_path("1968"), 20)
#+END_SRC

#+RESULTS:
1	[[https://en.wikipedia.org/wiki/Bert_Wheeler][Bert Wheeler]]
2	[[https://en.wikipedia.org/wiki/Broadway_theatre][Broadway theatre]]
3	[[https://en.wikipedia.org/wiki/Palmer%27s_Theatre][Palmer's Theatre]]
4	[[https://en.wikipedia.org/wiki/Fulton_Theatre][Fulton Theatre]]
5	[[https://en.wikipedia.org/wiki/44th_Street_Theatre][44th Street Theatre]]
6	[[https://en.wikipedia.org/wiki/Longacre_Theatre][Longacre Theatre]]
7	[[https://en.wikipedia.org/wiki/St._James_Theatre][St. James Theatre]]
8	[[https://en.wikipedia.org/wiki/Native_Son][Native Son]]
9	[[https://en.wikipedia.org/wiki/Modern_Library_List_of_Best_20th-Century_Novels][Modern Library List of Best 20th-Century Novels]]
10	[[https://en.wikipedia.org/wiki/Scientology][Scientology]]
11	[[https://en.wikipedia.org/wiki/Cult_Awareness_Network][Cult Awareness Network]]
12	[[https://en.wikipedia.org/wiki/Fight_Against_Coercive_Tactics_Network][Fight Against Coercive Tactics Network]]
13	[[https://en.wikipedia.org/wiki/Fishman_Affidavit][Fishman Affidavit]]
14	[[https://en.wikipedia.org/wiki/Church_of_Scientology_of_California_v._Armstrong][Church of Scientology of California v. Armstrong]]
15	[[https://en.wikipedia.org/wiki/Celebrity_Centres][Celebrity Centres]]
16	[[https://en.wikipedia.org/wiki/United_States_v._Hubbard][United States v. Hubbard]]
17	[[https://en.wikipedia.org/wiki/Scientology_Missions_International][Scientology Missions International]]
18	[[https://en.wikipedia.org/wiki/Clearwater_Hearings][Clearwater Hearings]]
19	[[https://en.wikipedia.org/wiki/Keeping_Scientology_Working][Keeping Scientology Working]]
20	[[https://en.wikipedia.org/wiki/Xenu][Xenu]]

*Bert Wheeler* was an American comedian who died in 1968. *Xenu* comes from scientology and is the dictator of the "Galactic Confederacy" who brought some of his people to Earth and killed them - their immortal spirits (thetans) adhere to humans, causing spiritual harm. The biggest jump seems to come from the *Modern Library List of Best 20th Century Novels* to *Scientology*. It looks like it happened because there was a Reader's List that included *Battlefield Earth* by *Scientology* founder L. Ron Hubbard.
** Twenty pages from the zombie fungus
#+BEGIN_SRC ipython :session sixdegrees :results output raw
grab_pages(to_path("Ophiocordyceps_unilateralis"), 20)
#+END_SRC

#+RESULTS:
1	[[https://en.wikipedia.org/wiki/PubMed_Central][PubMed Central]]
2	[[https://en.wikipedia.org/wiki/Document_Type_Definition][Document Type Definition]]
3	[[https://en.wikipedia.org/wiki/Parsing][Parsing]]
4	[[https://en.wikipedia.org/wiki/Compiler_frontend][Compiler frontend]]
5	[[https://en.wikipedia.org/wiki/Formal_methods][Formal methods]]
6	[[https://en.wikipedia.org/wiki/Concurrent_computing][Concurrent computing]]
7	[[https://en.wikipedia.org/wiki/Digital_object_identifier][Digital object identifier]]
8	[[https://en.wikipedia.org/wiki/ISO_13399][ISO 13399]]
9	[[https://en.wikipedia.org/wiki/Antimagnetic_watch][Antimagnetic watch]]
10	[[https://en.wikipedia.org/wiki/MPEG-4_Part_2][MPEG-4 Part 2]]
11	[[https://en.wikipedia.org/wiki/H.263][H.263]]
12	[[https://en.wikipedia.org/wiki/MOD_and_TOD][MOD and TOD]]
13	[[https://en.wikipedia.org/wiki/8_mm_video_format][8 mm video format]]
14	[[https://en.wikipedia.org/wiki/HDCAM#HDCAM_SR][HDCAM]]
15	[[https://en.wikipedia.org/wiki/Wayback_Machine][Wayback Machine]]
16	[[https://en.wikipedia.org/wiki/Netnews][Netnews]]
17	[[https://en.wikipedia.org/wiki/Pingback][Pingback]]
18	[[https://en.wikipedia.org/wiki/History_of_podcasting][History of podcasting]]
19	[[https://en.wikipedia.org/wiki/Shiira][Shiira]]
20	[[https://en.wikipedia.org/wiki/Software_bug][Software bug]]

This one jumped pretty quickly to computer-related subjets and seems to have gotten stuck there (*Shiira* was the name of a web-browser).
